In [ ]:
# import the dataset
xls = pd.ExcelFile("HR_DATABASE.xlsx")
xls.sheet_names

:

In [ ]:
# Import all spreadsheets
data = pd.read_excel("HR_DATABASE.xlsx", sheet_name=None)

basic = data["EMPLOYESS_BASICS"]
work = data["EMPLOYEES_WORKING_DETAILS"]
managers = data["EMPLOYEE_MANAGERS"]

managers.head(10)
basic.head()
work.head()

,MANAGER_ID,MANAGER_NAME,DEPORTMENT,MANAGER_EMAIL
0,MGR001,Alice Johnson,Business Development,alice.johnson@company.com
1,MGR002,Brian Smith,Data Intelligence,brian.smith@company.com
2,MGR003,Catherine Lee,HR DEPORTMENT,catherine.lee@company.com
3,MGR004,David Kumar,IT,david.kumar@company.com
4,MGR005,Gowtham,PMO,gowtham.pandiyan@company.com
5,MGR006,Davis Daniel,Product Design,Davis.Daniel@company.com
6,MGR007,Woodson Jason,Product Documentation,Woodson.Jason@company.com
7,MGR008,Valentin Jackie,QA,Valentin.Jackie@company.com
8,MGR009,Stanford Barbara,Software Engineering,Stanford.Barbara@company.com

In [ ]:
# Display info for each dataframe
managers.info()
basic.info()
work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   MANAGER_ID     9 non-null      object
 1   MANAGER_NAME   9 non-null      object
 2   DEPORTMENT     9 non-null      object
 3   MANAGER_EMAIL  9 non-null      object
dtypes: object(4)
memory usage: 420.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EMPLOYEE_ID    100 non-null    object
 1   NAME           100 non-null    object
 2   AGE            100 non-null    int64
 3   GENDER         100 non-null    object
 4   ADDRESS        100 non-null    object
 5   COUNTRY        100 non-null    object
 6   PINCODE        100 non-null    int64
 7   MOBILE_NUMBER  100 non-null    int64
 8   EMAIL_ID       100 non-null    object
 9   MANAGER_ID     100 non-null    object
dtypes: int64(3), object(7)
memory usage: 7.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   EMPLOYEE_ID      100 non-null    object
 1   NAME             100 non-null    object
 2   POSITION         100 non-null    object
 3   DEPORTMENT       100 non-null    object
 4   SALARY           100 non-null    float64
 5   EMPLOYEE_TYPE    100 non-null    object
 6   ACTIVE_EMPLOYEE  100 non-null    object
 7   JOINING_DATE     100 non-null    datetime64[ns]
 8   LOGIN_TIME       100 non-null    object
 9   WORKING_HOURS    100 non-null    int64
 10  MANAGER_ID       100 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(8)
memory usage: 8.7+ KB

In [25]:
 # Summary statistics using .describe()
# managers.describe(include='all')
{
    "Managers": managers.describe(include='all'),
    "Basic": basic.describe(include='all'),
    "Work": work.describe(include='all')
}

{'Managers':        MANAGER_ID   MANAGER_NAME            DEPORTMENT  \
 count           9              9                     9
 unique          9              9                     9
 top        MGR001  Alice Johnson  Business Development
 freq            1              1                     1

                     MANAGER_EMAIL
 count                           9
 unique                          9
 top     alice.johnson@company.com
 freq                            1  ,
 'Basic':        EMPLOYEE_ID        NAME        AGE  GENDER  \
 count          100         100  100.00000     100
 unique         100         100        NaN       3
 top         EMP001  Eric Stone        NaN  Female
 freq             1           1        NaN      35
 mean           NaN         NaN   42.70000     NaN
 std            NaN         NaN   11.20651     NaN
 min            NaN         NaN   22.00000     NaN
 25%            NaN         NaN   34.00000     NaN
 50%            NaN         NaN   44.00000     NaN
 75%            NaN         NaN   53.25000     NaN
 max            NaN         NaN   60.00000     NaN

                                                   ADDRESS COUNTRY  \
 count                                                 100     100
 unique                                                100       5
 top     66976 Larry Inlet Suite 945, Castillofort, WY ...   India
 freq                                                    1      35
 mean                                                  NaN     NaN
 std                                                   NaN     NaN
 min                                                   NaN     NaN
 25%                                                   NaN     NaN
 50%                                                   NaN     NaN
 75%                                                   NaN     NaN
 max                                                   NaN     NaN

              PINCODE  MOBILE_NUMBER            EMAIL_ID MANAGER_ID
 count     100.000000   1.000000e+02                 100        100
 unique           NaN            NaN                 100          9
 top              NaN            NaN  chad56@example.org     MGR009
 freq             NaN            NaN                   1         15
 mean    49823.810000   7.981913e+09                 NaN        NaN
 std     29183.795193   1.147033e+09                 NaN        NaN
 min      1228.000000   6.007321e+09                 NaN        NaN
 25%     28249.750000   7.020281e+09                 NaN        NaN
 50%     46807.500000   7.958796e+09                 NaN        NaN
 75%     75998.250000   9.005299e+09                 NaN        NaN
 max     99832.000000   9.974797e+09                 NaN        NaN  ,
 'Work':        EMPLOYEE_ID        NAME         POSITION            DEPORTMENT  \
 count          100         100              100                   100
 unique         100         100               10                     9
 top         EMP001  Eric Stone  Project Manager  Software Engineering
 freq             1           1               13                    15
 mean           NaN         NaN              NaN                   NaN
 min            NaN         NaN              NaN                   NaN
 25%            NaN         NaN              NaN                   NaN
 50%            NaN         NaN              NaN                   NaN
 75%            NaN         NaN              NaN                   NaN
 max            NaN         NaN              NaN                   NaN
 std            NaN         NaN              NaN                   NaN

                SALARY EMPLOYEE_TYPE ACTIVE_EMPLOYEE         JOINING_DATE  \
 count      100.000000           100             100                  100
 unique            NaN             4               2                  NaN
 top               NaN        Intern          ACTIVE                  NaN
 freq              NaN            29              52                  NaN
 mean    101910.993600           NaN             NaN  2019-10-19 16:33:36
 min      50525.120000           NaN             NaN  2015-04-22 00:00:00
 25%      77974.887500           NaN             NaN  2017-04-20 18:00:00
 50%     103047.260000           NaN             NaN  2019-06-15 00:00:00
 75%     128067.370000           NaN             NaN  2022-01-17 12:00:00
 max     149997.660000           NaN             NaN  2024-12-15 00:00:00
 std      30576.031458           NaN             NaN                  NaN

        LOGIN_TIME  WORKING_HOURS MANAGER_ID
 count         100     100.000000        100
 unique          4            NaN          9
 top      10:00:00            NaN     MGR009
 freq           31            NaN         15
 mean          NaN       8.040000        NaN
 min           NaN       6.000000        NaN
 25%           NaN       7.000000        NaN
 50%           NaN       8.000000        NaN
 75%           NaN       9.000000        NaN
 max           NaN      10.000000        NaN
 std           NaN       1.420769        NaN  }

In [24]:
# Checking if missing data or null values are present in the dataset
missing_summary = {
    "managers": managers.isnull().sum(),
    "basic": basic.isnull().sum(),
    "work": work.isnull().sum()
}

missing_summary

{'managers': MANAGER_ID       0
 MANAGER_NAME     0
 DEPORTMENT       0
 MANAGER_EMAIL    0
 dtype: int64,
 'basic': EMPLOYEE_ID      0
 NAME             0
 AGE              0
 GENDER           0
 ADDRESS          0
 COUNTRY          0
 PINCODE          0
 MOBILE_NUMBER    0
 EMAIL_ID         0
 MANAGER_ID       0
 dtype: int64,
 'work': EMPLOYEE_ID        0
 NAME               0
 POSITION           0
 DEPORTMENT         0
 SALARY             0
 EMPLOYEE_TYPE      0
 ACTIVE_EMPLOYEE    0
 JOINING_DATE       0
 LOGIN_TIME         0
 WORKING_HOURS      0
 MANAGER_ID         0
 dtype: int64}

In [28]:
import pandas as pd

# Load all sheets
data = pd.read_excel("HR_DATABASE.xlsx", sheet_name=None)

# Define age group labels
labels = ['Young', 'Adult', 'Senior']

# Loop through all sheets and create age_group where possible
for name, df in data.items():
    print(f"\nProcessing sheet: {name}")
    
    # Check if 'age' column exists in the sheet
    if 'age' in df.columns:
        # Create age_group using qcut
        df['age_group'] = pd.qcut(df['age'].rank(method='first'), q=3, labels=labels)
        
        # Show sample output
        print(df[['age', 'age_group']].head(10))
    else:
        print("No 'age' column found — skipping age_group creation.")

Processing sheet: EMPLOYESS_BASICS
No 'age' column found — skipping age_group creation.

Processing sheet: EMPLOYEES_WORKING_DETAILS
No 'age' column found — skipping age_group creation.

Processing sheet: EMPLOYEE_MANAGERS
No 'age' column found — skipping age_group creation.

In [36]:
basic.columns

Index(['EMPLOYEE_ID', 'NAME', 'AGE', 'GENDER', 'ADDRESS', 'COUNTRY', 'PINCODE',
       'MOBILE_NUMBER', 'EMAIL_ID', 'MANAGER_ID'],
      dtype='object')

In [37]:
# Find any column that contains the word "age"
age_col = [col for col in basic.columns if 'age' in col.lower()]

print("Detected age column:", age_col)

Detected age column: ['AGE', 'MANAGER_ID']

In [39]:
labels = ['Young', 'Adult', 'Senior']

# Use only the actual age column 'AGE'
age_col = 'AGE'

basic['age_group'] = pd.qcut(basic[age_col], q=3, labels=labels)

basic[[age_col, 'age_group']].head(10)

   AGE age_group
0   47     Adult
1   28     Young
2   39     Adult
3   24     Young
4   54    Senior
5   27     Young
6   58    Senior
7   40     Adult
8   59    Senior
9   31     Young

In [45]:
basic.head()
work.head()
managers.head()

,EMPLOYEE_ID,NAME,POSITION,DEPORTMENT,SALARY,EMPLOYEE_TYPE,ACTIVE_EMPLOYEE,JOINING_DATE,LOGIN_TIME,WORKING_HOURS,MANAGER_ID
0,EMP001,Eric Stone,Business Analyst,Business Development,137238.30,Full-Time,ACTIVE,2020-10-17,09:00:00,8,MGR001
1,EMP002,Kurt Love,HR Manager,HR DEPORTMENT,124676.64,Intern,ACTIVE,2019-10-14,08:00:00,9,MGR003
2,EMP003,Eric Becker,Project Manager,PMO,119400.12,Full-Time,ACTIVE,2021-04-08,10:00:00,6,MGR005
3,EMP004,Daniel Potter,QA Engineer,QA,85846.33,Intern,ACTIVE,2023-08-03,09:00:00,10,MGR008
4,EMP005,Pamela Walker,UI/UX Designer,Product Design,106592.81,Part-Time,ACTIVE,2023-12-22,09:00:00,6,MGR006

In [62]:
import pandas as pd
from sqlalchemy import create_engine

# MySQL connection details
username = "root"
password = "Gowtham$73"
host = "localhost"
port = "3306"
database = "hr_dataset"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Load Excel file
data = pd.read_excel("HR_DATABASE_updated.xlsx", sheet_name=None)

# Upload all sheets
for sheet_name, df in data.items():
    table_name = sheet_name.lower().replace(" ", "_")
    df.to_sql(table_name, engine, if_exists="replace", index=False)
    print(f"Uploaded: {sheet_name} → {table_name}")

print("Upload completed!\n")

# SHOW TABLES
print(pd.read_sql("SHOW TABLES;", engine))

# Example: Read first table
first_table = pd.read_sql("SHOW TABLES;", engine).iloc[0, 0]
print(f"\nReading first table: {first_table}")
print(pd.read_sql(f"SELECT * FROM {first_table} LIMIT 5;", engine))

Uploaded: EMPLOYESS_BASICS → employess_basics
Uploaded: EMPLOYEES_WORKING_DETAILS → employees_working_details
Uploaded: EMPLOYEE_MANAGERS → employee_managers
Upload completed!

        Tables_in_hr_dataset
0          employee_managers
1  employees_working_details
2           employess_basics

Reading first table: employee_managers
  MANAGER_ID   MANAGER_NAME            DEPORTMENT  \
0     MGR001  Alice Johnson  Business Development
1     MGR002    Brian Smith     Data Intelligence
2     MGR003  Catherine Lee         HR DEPORTMENT
3     MGR004    David Kumar                    IT
4     MGR005        Gowtham                   PMO

                   MANAGER_EMAIL
0      alice.johnson@company.com
1        brian.smith@company.com
2      catherine.lee@company.com
3        david.kumar@company.com
4  gowtham.pandiyan@company.com